/**
 * Вывести на экран соответствий между символами и их численными обозначениями в памяти компьютера.
 */
package by_module_01;

/**
 * @author kabal
 *
 */
public class cyclesTask06 {

	public static void main(String[] args) {
	String count;
		for (int i = 1; i < 128; i++) {
			System.out.println(count=(char)i + "  -  " +i);
		}
	}

}
